/******************************************************************************
 * Copyright (C) 2023 Nymph <Academy of Artemis>
 * Copyright (C) 2023 liulitchi <kz-xy@163.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 
 
 * Ακαδημία της Αρτέμιδος(Academy of Artemis) is a loosely connected 
 * network of math learning group, whose members share a common interest 
 * in mathematics and statistics and often exchange their learning 
 * experiences with one another.
 *

 *
 * book.h: 宋·朱河《除红谱》
 *
 * Last edited: 2023/8/7
 ******************************************************************************/

const int points[62] = {

    4444, 6666, 5555, 3333, 2222, 1111,          /*浑花6*/ 
    1444, 2444, 3444, 4445, 4446,                /*三红5*/
    1144, 2244, 3344, 4455, 4466, 4456,          /*双红6*/
    1122, 1133, 1155, 1166, 2233,                /*对子10*/
    2255, 2266, 3355, 3366, 5566,
    4666, 4566, 4556, 4555, 3466,                /*18-15*/ 
    3456, 3466, 2456, 1466, 3455,                /*14-13*/
    2455, 3346, 1456, 3345, 1455, 2346,          /*12-11*/  
    2246, 1346, 2345, 2334, 1246, 1345, 2245,    /*10-9*/ 
    1245, 1146, 2334, 1334, 1145, 2234,          /*8-7*/
    1234, 2224, 1224, 1134, 1124, 1114,          /*6-3*/
};


const char name[62][15] = {

    "浑四", "浑六", "浑五", "浑三", "浑二", "浑幺",                           /*浑花6*/ 
    "三红一幺", "三红一二", "三红一三", "三红一五", "三红一六",               /*三红5*/
    "双红双幺", "双红双二", "双红双三", "双红双五", "双红双六", "双红五六",   /*双红6*/
    "双幺双二", "双幺双三", "双幺双五", "双幺双六", "双二双三",               /*对子10*/ 
    "双二双五", "双二双六", "双三双五", "双三双六", "双五双六",
    "六六六", "五六六", "五五六", "五五五", "三六六",                         /*18-15*/ 
    "三五六", "二六六", "二五六", "幺六六", "三五五",                         /*14-13*/
    "二五五", "三三六", "幺五六", "三三五", "幺五五", "二三六",               /*12-11*/  
    "二二六", "幺三六", "二三五", "三三三", "幺二六", "幺三五", "二二五",     /*10-9*/ 
    "幺二五", "幺幺六", "二三三", "幺三三", "幺幺五", "二二三",               /*8-7*/
    "幺二三", "二二二", "幺二二", "幺幺三", "幺幺二", "幺幺幺",               /*6-3*/
};


const char alias[62][18] = {

    "满园春", "混江龙", "碧牡丹", "雁行儿", "拍板儿", "满盆星",           /*浑花6*/ 
    "花心动", "蝶恋花", "红衫儿", "锦上花", "销金帐",                     /*三红5*/
    "红叶儿", "红叶儿", "红叶儿", "红叶儿", "红叶儿", "节节高",           /*双红6*/
    "素叶儿", "素叶儿", "素叶儿", "素叶儿", "素叶儿",                     /*对子10*/
    "素叶儿", "素叶儿", "素叶儿", "素叶儿", "素叶儿",  
    "得胜令", "皂罗袍", "雪儿梅", "永团圆", "皂雕旗",                     /*18-15*/ 
    "穿花凤", "铁道冠", "野鸡头", "点绛唇", "凤归云",                     /*14-13*/
    "十二时", "鹧鸪天", "巫山一段云", "鹊踏枝", "梅梢月", "画眉不尽",     /*12-11*/  
    "夹十儿", "撮十儿", "落梅花", "柳叶儿", "女冠子", "一剪梅", "锁南枝", /*10-9*/  
    "锁顶八", "睁眼八", "雁儿八", "川七儿", "白七儿", "夹七儿",           /*8-7*/ 
    "耍孩儿", "粉蝶儿", "五供养", "葫芦儿", "咬牙四", "快活三",           /*6-3*/
};


const char category[62][12] = {

    "浑花", "浑花", "浑花", "浑花", "浑花", "浑花", 
    "三红", "三红", "三红", "三红", "三红",               
    "双红", "双红", "双红", "双红", "双红", "双红", 
    "对子", "对子", "对子", "对子", "对子", 
    "对子", "对子", "对子", "对子", "对子", 
    "十八点", "十七点", "十六点", "十五点", "十五点", 
    "十四点", "十四点", "十三点", "十三点", "十三点", 
    "十二点", "十二点", "十二点", "十一点", "十一点", "十一点",
    "十点", "十点", "十点", "九点", "九点", "九点", "九点", 
    "八点", "八点", "八点", "七点", "七点", "七点",
    "六点", "六点", "五点", "五点", "四点", "三点",  
};
/*
char reward[62][] = {

    "", "", "", "", "", "",    
    "", "", "", "", "", "",
    "", "", "", "", "", "",    
    "", "", "", "", "", "",
    "", "", "", "", "", "",    
    "", "", "", "", "", "",
    "", "", "", "", "", "",    
    "", "", "", "", "", "",
};
*/

